{
  "latestVersion": "4.1.14",
  "updatedAt": "2026-02-11",
  "releases": [
    {
      "version": "4.1.14",
      "date": "2026-02-11",
      "title": "Owner por token, setup alinhado e sincronizacao bot -> UI",
      "summary": "Release focada em coerencia do onboarding com owner por token/comando, sincronizacao de configuracoes em tempo real e atualizacao dos guias operacionais.",
      "highlights": [
        "Definicao de owner por token/comando no WhatsApp (!owner <token>).",
        "Setup inicial atualizado para usar o fluxo novo de owner por token.",
        "Botao de gerar token de owner na tela de configuracoes.",
        "Sincronizacao de settings do bot para a UI sem reinicio manual."
      ],
      "technical": [
        "Novo estado de token de owner em settings (hash + expiracao).",
        "Novos handlers IPC para gerar/limpar token no processo principal.",
        "Bot com validacao de token e comandos !owner/!setowner.",
        "Evento settings-updated para manter renderer sincronizado."
      ],
      "fixes": [
        "Removida divergencia entre setup/UI e metodo real de definicao de owner.",
        "Melhorada consistencia visual apos mudancas de configuracao aplicadas pelo bot.",
        "Documentacao operacional unificada para o novo onboarding."
      ],
      "upgradeNotes": [
        "Sem migracao obrigatoria.",
        "Recomendado validar o fluxo: gerar token no app e enviar !owner <token> no DM."
      ]
    },
    {
      "version": "4.1.13",
      "date": "2026-02-11",
      "title": "Correcao de auto-update para instalacoes RPM no Linux",
      "summary": "Patch de release para garantir que o feed Linux inclua RPM e permita atualizacao automatica correta em ambientes Fedora/openSUSE/RHEL.",
      "highlights": [
        "Feed latest-linux.yml com entrada .rpm (url, sha512 e size).",
        "Workflow Linux atualiza e republica o feed apos build do RPM.",
        "Compatibilidade de update alinhada para instalacoes via RPM."
      ],
      "technical": [
        "Novo script scripts/patch-linux-feed-with-rpm.js.",
        "Release workflow sobrescrevendo latest-linux.yml com --clobber.",
        "Fluxo Linux mantendo AppImage/.deb/.rpm no mesmo ciclo de publicacao."
      ],
      "fixes": [
        "Resolvido feed Linux sem RPM.",
        "Corrigido caso de nao atualizacao em instalacoes RPM."
      ],
      "upgradeNotes": [
        "Sem migracao obrigatoria.",
        "Recomendado atualizar para esta versao em hosts Linux que usam RPM."
      ]
    },
    {
      "version": "4.1.12",
      "date": "2026-02-11",
      "title": "Alinhamento de setup inicial, tools e documentacao",
      "summary": "Release focada em coerencia entre comportamento real do app e os guias operacionais, com correcoes no setup inicial e nas regras de aprovacao de tools.",
      "highlights": [
        "Setup inicial volta a abrir quando falta API Key ou owner.",
        "Botao 'Abrir Setup Inicial' em Configuracoes para reabrir o assistente.",
        "Contexto situacional de runtime agora injetado no prompt do bot."
      ],
      "technical": [
        "Regra do setup reforcada no renderer para nao depender apenas de estado local antigo.",
        "Aplicacao efetiva de tools.mode=manual no core.",
        "Acoes sensiveis exigindo aprovacao explicita por design."
      ],
      "fixes": [
        "Documentacao de aprovacao alinhada com comandos reais por ID.",
        "Exemplos de comandos e prerequisitos de owner ajustados nos docs."
      ],
      "upgradeNotes": [
        "Sem migracao obrigatoria.",
        "Recomendado validar o setup inicial no app apos atualizar."
      ]
    },
    {
      "version": "4.1.11",
      "date": "2026-02-11",
      "title": "Consolidacao de setup, CI/build Linux e empacotamento",
      "summary": "Release de manutencao que formaliza os patches de onboarding com owner, CI mais estrito e pacote final mais enxuto.",
      "highlights": [
        "Setup inicial em 4 etapas com definicao de owner no proprio app.",
        "CI com lint e test antes dos checks de sintaxe.",
        "Build Linux com fallback para AppImage quando faltar libcrypt.so.1.",
        "Empacotamento sem docs/scripts/metadados do repositorio."
      ],
      "technical": [
        "Novo script scripts/build-linux.sh para orquestrar fallback de build Linux.",
        "Ajustes em .github/workflows/ci.yml para elevar o gate de qualidade.",
        "Regras de build.files em package.json para excluir itens nao essenciais do artefato."
      ],
      "fixes": [
        "Reducao do tamanho do pacote final.",
        "Fluxo de release Linux mais previsivel em hosts com restricoes de compatibilidade."
      ],
      "upgradeNotes": [
        "Nenhuma migracao obrigatoria.",
        "Recomendado validar higiene do pacote na release checklist."
      ]
    },
    {
      "version": "4.1.10",
      "date": "2026-02-10",
      "title": "Estabilidade de configuracao e seguranca operacional",
      "summary": "Release focada em operacao diaria com perfis, politicas de acesso e tools com defaults conservadores.",
      "highlights": [
        "Contexto situacional nativo no prompt (hora, SO, Node e diretorio).",
        "Fluxo de perfis (agentes) com roteamento por usuario e grupo.",
        "Tools com aprovacao do owner e auditoria local."
      ],
      "technical": [
        "Normalizacao de dmPolicy/groupPolicy com compatibilidade legada.",
        "Persistencia de API Key via keytar com fallback seguro.",
        "Validacao de caminhos e dominios nas tools."
      ],
      "fixes": [
        "Melhorias de robustez no envio de mensagens ao provedor.",
        "Fallback mais previsivel quando o modelo nao suporta tools."
      ],
      "upgradeNotes": [
        "Defina ownerNumber/ownerJid antes de liberar tools.",
        "Revise allowedPaths/allowedWritePaths e filtros de dominio."
      ]
    }
  ],
  "patchesSinceLatest": [],
  "roadmap": {
    "next": {
      "focus": [
        "Expandir smoke tests E2E para onboarding e fluxo de update no app instalado.",
        "Reforcar validacoes de release para confirmar mudancas visuais no renderer apos update.",
        "Seguir reduzindo regressao entre documentacao e comportamento real."
      ]
    }
  }
}
