{
  "latestVersion": "4.1.12",
  "updatedAt": "2026-02-11",
  "releases": [
    {
      "version": "4.1.12",
      "date": "2026-02-11",
      "title": "Alinhamento de setup inicial, tools e documentacao",
      "summary": "Release focada em coerencia entre comportamento real do app e os guias operacionais, com correcoes no setup inicial e nas regras de aprovacao de tools.",
      "highlights": [
        "Setup inicial volta a abrir quando falta API Key ou owner.",
        "Botao 'Abrir Setup Inicial' em Configuracoes para reabrir o assistente.",
        "Contexto situacional de runtime agora injetado no prompt do bot."
      ],
      "technical": [
        "Regra do setup reforcada no renderer para nao depender apenas de estado local antigo.",
        "Aplicacao efetiva de tools.mode=manual no core.",
        "Acoes sensiveis exigindo aprovacao explicita por design."
      ],
      "fixes": [
        "Documentacao de aprovacao alinhada com comandos reais por ID.",
        "Exemplos de comandos e prerequisitos de owner ajustados nos docs."
      ],
      "upgradeNotes": [
        "Sem migracao obrigatoria.",
        "Recomendado validar o setup inicial no app apos atualizar."
      ]
    },
    {
      "version": "4.1.11",
      "date": "2026-02-11",
      "title": "Consolidacao de setup, CI/build Linux e empacotamento",
      "summary": "Release de manutencao que formaliza os patches de onboarding com owner, CI mais estrito e pacote final mais enxuto.",
      "highlights": [
        "Setup inicial em 4 etapas com definicao de owner no proprio app.",
        "CI com lint e test antes dos checks de sintaxe.",
        "Build Linux com fallback para AppImage quando faltar libcrypt.so.1.",
        "Empacotamento sem docs/scripts/metadados do repositorio."
      ],
      "technical": [
        "Novo script scripts/build-linux.sh para orquestrar fallback de build Linux.",
        "Ajustes em .github/workflows/ci.yml para elevar o gate de qualidade.",
        "Regras de build.files em package.json para excluir itens nao essenciais do artefato."
      ],
      "fixes": [
        "Reducao do tamanho do pacote final.",
        "Fluxo de release Linux mais previsivel em hosts com restricoes de compatibilidade."
      ],
      "upgradeNotes": [
        "Nenhuma migracao obrigatoria.",
        "Recomendado validar higiene do pacote na release checklist."
      ]
    },
    {
      "version": "4.1.10",
      "date": "2026-02-10",
      "title": "Estabilidade de configuracao e seguranca operacional",
      "summary": "Release focada em operacao diaria com perfis, politicas de acesso e tools com defaults conservadores.",
      "highlights": [
        "Contexto situacional nativo no prompt (hora, SO, Node e diretorio).",
        "Fluxo de perfis (agentes) com roteamento por usuario e grupo.",
        "Tools com aprovacao do owner e auditoria local."
      ],
      "technical": [
        "Normalizacao de dmPolicy/groupPolicy com compatibilidade legada.",
        "Persistencia de API Key via keytar com fallback seguro.",
        "Validacao de caminhos e dominios nas tools."
      ],
      "fixes": [
        "Melhorias de robustez no envio de mensagens ao provedor.",
        "Fallback mais previsivel quando o modelo nao suporta tools."
      ],
      "upgradeNotes": [
        "Defina ownerNumber/ownerJid antes de liberar tools.",
        "Revise allowedPaths/allowedWritePaths e filtros de dominio."
      ]
    }
  ],
  "patchesSinceLatest": [],
  "roadmap": {
    "next": {
      "focus": [
        "Expandir smoke tests para setup inicial e build Linux.",
        "Seguir reduzindo o tamanho do pacote final mantendo apenas runtime necessario.",
        "Evoluir o onboarding com mensagens de erro mais acionaveis em cada etapa."
      ]
    }
  }
}
